**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [82]:
import pandas as pd
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
df = pd.DataFrame(data)
df['labels'] = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df.set_index('labels')

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [83]:
print('Basic calculations: \n ', df.describe())
print('--'*10)

print('Types of birds: \n', df['birds'].unique())
print('--'*10)

print('Average age: \n', df['age'].mean())
print('--'*10)

new_df = df.loc[df['priority'] == 'yes']
print('Birds with highest priority: \n', new_df['birds'].unique())
print('--'*10)

new_df2 = df.loc[df['priority'] == 'no']
print('Birds with lowest priority: \n', new_df2['birds'].unique())
print('--'*10)

for i in df['birds'].unique():
    print('Average visitors for ', i, ':', int(df[df['birds'] == i]['visits'].mean()))

Basic calculations:
              age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000
--------------------
Types of birds:
 ['Cranes' 'plovers' 'spoonbills']
--------------------
Average age:
 4.4375
--------------------
Birds with highest priority:
 ['Cranes' 'spoonbills']
--------------------
Birds with lowest priority:
 ['plovers' 'spoonbills' 'Cranes']
--------------------
Average visitors for  Cranes : 3
Average visitors for  plovers : 2
Average visitors for  spoonbills : 3

**3. Print the first 2 rows of the birds dataframe**

In [84]:
df[0:2]

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
1  Cranes  4.0       4      yes      b

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [85]:
df2 = df[['birds', 'age']]
df2

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [86]:
df3 = df[['birds', 'age', 'visits']]
df3.loc[[2, 3, 7], :]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [87]:
df.loc[df['visits'] <= 4]

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [88]:
df4 = df.loc[df['age'].isnull()]
df4[['birds', 'visits']]

        birds  visits
3  spoonbills       4
7      Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [89]:
df.loc[(df['birds'] == 'Cranes') & (df['age'] < 4)]

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
5  Cranes  3.0       4       no      f

**9. Select the rows the age is between 2 and 4(inclusive)**

In [90]:
df.loc[df['age'].between(2, 4, inclusive=True)]

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
5      Cranes  3.0       4       no      f
9  spoonbills  4.0       2       no      j

**10. Find the total number of visits of the bird Cranes**

In [91]:
df[df['birds'] == 'Cranes']['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [92]:
df5 = df.dropna()
df5.groupby(['birds'])['age'].agg(lambda x: x.unique().mean())

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [93]:
df['k'] = np.arange(0, 10)
print(df.head())
df = df.drop(['k'], axis=1)
print('--'*25)
print(df)

        birds  age  visits priority labels  k
0      Cranes  3.5       2      yes      a  0
1      Cranes  4.0       4      yes      b  1
2     plovers  1.5       3       no      c  2
3  spoonbills  NaN       4      yes      d  3
4  spoonbills  6.0       3       no      e  4
--------------------------------------------------
        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**13. Find the number of each type of birds in dataframe (Counts)**

In [94]:
df['birds'].value_counts()

Cranes        4
spoonbills    4
plovers       2
Name: birds, dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [95]:
print(df.sort_values(['age'], ascending=False))
print('--'*20)
print(df.sort_values(['visits']))

        birds  age  visits priority labels
8  spoonbills  8.0       3       no      i
4  spoonbills  6.0       3       no      e
6     plovers  5.5       2       no      g
1      Cranes  4.0       4      yes      b
9  spoonbills  4.0       2       no      j
0      Cranes  3.5       2      yes      a
5      Cranes  3.0       4       no      f
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
7      Cranes  NaN       2      yes      h
----------------------------------------
        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
9  spoonbills  4.0       2       no      j
2     plovers  1.5       3       no      c
4  spoonbills  6.0       3       no      e
8  spoonbills  8.0       3       no      i
1      Cranes  4.0       4      yes      b
3  spoonbills  NaN       4      yes      d
5      Cranes  3.0       4       no      f

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [96]:
df.replace({'priority' : {'yes': 1, 'no' : 0}})

        birds  age  visits  priority labels
0      Cranes  3.5       2         1      a
1      Cranes  4.0       4         1      b
2     plovers  1.5       3         0      c
3  spoonbills  NaN       4         1      d
4  spoonbills  6.0       3         0      e
5      Cranes  3.0       4         0      f
6     plovers  5.5       2         0      g
7      Cranes  NaN       2         1      h
8  spoonbills  8.0       3         0      i
9  spoonbills  4.0       2         0      j

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [97]:
df.replace({'birds' : {'Cranes': 'trumpeters'}})

        birds  age  visits priority labels
0  trumpeters  3.5       2      yes      a
1  trumpeters  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5  trumpeters  3.0       4       no      f
6     plovers  5.5       2       no      g
7  trumpeters  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j